Documents/Лео_Переработчики/Лео_Переработчики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_Переработчики</name>
  <registerRecords>AccumulationRegister.Лео_Переработчики</registerRecords>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Человек</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЧел</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаОсновании</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГлавБух</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабЧасть</name>
    <attributes>
      <name>День</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УпакованоВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКГ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УпакованоОбщее</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отклонение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЧел</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Претензии</name>
    <attributes>
      <name>НомерПретензии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПретензии</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПретензии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/Лео_Переработчики/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	// Вставить содержимое обработчика.
	
	ПолучитьДанныеEXCEL();
	
	
КонецПроцедуры



Функция ЗаполнитьКоличествоКГ(_Контрагент,_ПрефиксКонтрагента,_КоличествоЧ,_ЦенаЧел)
// КоличествоКГ
_КоличествоКГ = 0;
_Переработчики = Справочники.Лео_Настройки.НайтиПоРеквизиту("_Ссылка",_Контрагент,Справочники.Лео_Настройки.НайтиПоНаименованию("Переработчики"));
		Если ЗначениеЗаполнено(_Переработчики) тогда
		 Если _ПрефиксКонтрагента = _Переработчики.Наименование тогда
			_КоличествоКГ = _КоличествоЧ * _ЦенаЧел;
		 КонецЕсли;	
	    КонецЕсли;	
	 возврат _КоличествоКГ;
КонецФункции

&НаКлиенте
Процедура ПолучитьДанныеEXCEL()
	
	
	//ПолучитКоличествоУчетПоСкладу();
	
	
	Попытка
		ExcelApp = Новый COMОбъект("Excel.Application");
	Исключение
		Возврат;
	КонецПопытки;
	                              
	Книга = ExcelApp.WorkBooks.Open(Объект.ПутьКФайлу);
	Страница = Книга.WorkSheets(1);  
	
	
	_КолвоКонтрагентов = Объект.Контрагенты.количество();
	
	Объект.ТабЧасть.Очистить();
	ВсегоСтрок = Страница.Cells(1,1).SpecialCells(11).Row;
	НомерПервойСтроки = 4; Шаг = 2;
	Для Номер = НомерПервойСтроки по ВсегоСтрок цикл
		
		
		//ОбработкаПрерыванияПользователя();
	
		//Если сокрлп(Формат(ExcelApp.Cells(Номер,11).Value,"ЧГ=0")) = "АУП" тогда
		//	
		//иначе
		//	продолжить;
		//Конецесли;
		
		//Если ExcelApp.Cells(Номер,НомерКолонкиИзменения).Value = 1 тогда
		
		//Стр.Подразделение = сокрлп(Формат(ExcelApp.Cells(Номер,9).Value,"ЧГ=0"));
		
		_День = сокрлп(Формат(ExcelApp.Cells(Номер,1).Value,"ЧГ=0"));
		_КоличествоЧ = сокрЛП(Формат(ExcelApp.Cells(Номер,2).Value,"ЧГ=0"));
		//_КоличествоЧ1 = сокрЛП(Формат(ExcelApp.Cells(Номер,4).Value,"ЧГ=0"));
        вКоличествоКГ = 0;
        вКоличествоЧ = 0;
		Для каждого кк из Объект.Контрагенты цикл
			
		//Индекс = кк.ИсходныйНомерСтроки	+ 1;
		ИндексК = кк.НомерСтроки * Шаг;
			
		_КоличествоЧ = сокрЛП(Формат(ExcelApp.Cells(Номер,ИндексК).Value,"ЧГ=0"));
		
		Если ЗначениеЗаполнено(_День) и ЗначениеЗаполнено(_КоличествоЧ) тогда
		Стр = Объект.ТабЧасть.Добавить();
		Стр.День = Дата(Сред(_День,7,4),Сред(_День,4,2),Лев(_День,2));
		Стр.КоличествоЧ = _КоличествоЧ;
		Стр.Контрагент = кк.Контрагент;
		_ПрефиксКонтрагента = сокрлп(Формат(ExcelApp.Cells(3,ИндексК).Value,"ЧГ=0")); // КР
		_ЦенаЧел            = Объект.Контрагенты[кк.НомерСтроки - 1].ЦенаЧел;
		Стр.ЦенаЧел = _ЦенаЧел;
		Стр.КоличествоКГ = ЗаполнитьКоличествоКГ(Стр.Контрагент,_ПрефиксКонтрагента,_КоличествоЧ,_ЦенаЧел);
		вКоличествоКГ = вКоличествоКГ + Стр.КоличествоКГ;
		вКоличествоЧ  = вКоличествоЧ  + Стр.КоличествоЧ;
	    Конецесли;
		
		КонецЦикла;

		
		//Если ЗначениеЗаполнено(_День) и ЗначениеЗаполнено(_КоличествоЧ1) тогда
		//Стр = Объект.ТабЧасть.Добавить();
		//Стр.День = Дата(Сред(_День,7,4),Сред(_День,4,2),Лев(_День,2));
		//Стр.КоличествоЧ = _КоличествоЧ1;
		//Конецесли;
		
		
		
	
		
		// За день
		Если ЗначениеЗаполнено(_День) и ЗначениеЗаполнено(_КоличествоЧ) тогда
		Стр = Объект.ТабЧасть.Добавить();
		Стр.День = Дата(Сред(_День,7,4),Сред(_День,4,2),Лев(_День,2));
		Стр.Контрагент   = "Всего:"; 
		Стр.КоличествоЧ  = вКоличествоЧ;
		Стр.КоличествоКГ = вКоличествоКГ;
		Стр.Отклонение   = -вКоличествоКГ; 
	    Конецесли;
		
		
			
	КонецЦикла;
	
	// перед получением учетных данных (количество) свернем тз
    //Посещения.Свернуть("Флаг,Артикул,Номенклатура,СпецификацияОсн,СпецификацияПлан");
	
	
	
	ExcelApp.Application.Quit();  
	
	УстановитьУсловноеОформлениеТаблицы();	
	
	ЗаполнитьВыпускЗаМесяц(Объект.Дата);
	
	
	
КонецПроцедуры

Процедура ЗаполнитьВыпускЗаМесяц(ДатаКон)

	мВидНоменклатуры = Новый Массив;
	мВидНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Полуфабрикат"));
	мВидНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Конечная продукция"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОбороты.Номенклатура,
		|	ТоварыНаСкладахОбороты.КоличествоПриход КАК Количество,
		|	ТоварыНаСкладахОбороты.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	ТоварыНаСкладахОбороты.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХраненияОстатков,
		|	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОбороты.Период, ДЕНЬ) КАК Период
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Обороты(НАЧАЛОПЕРИОДА(&ДатаКон, МЕСЯЦ), КОНЕЦПЕРИОДА(&ДатаКон, МЕСЯЦ), Регистратор, ) КАК ТоварыНаСкладахОбороты
		|ГДЕ
		|	ТоварыНаСкладахОбороты.Регистратор ССЫЛКА Документ.ОтчетПроизводстваЗаСмену
		|	И ТоварыНаСкладахОбороты.Номенклатура.ВидНоменклатуры В(&ВидНоменклатуры)
		|	И НЕ(ТоварыНаСкладахОбороты.Номенклатура.Наименование ПОДОБНО ""ИГК%""
		|				ИЛИ ТоварыНаСкладахОбороты.Номенклатура.Наименование ПОДОБНО ""ИКГ%"")";

	Запрос.УстановитьПараметр("ВидНоменклатуры", мВидНоменклатуры);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);

	Результат = Запрос.Выполнить();
    ТЗ = Результат.Выгрузить();
     
	Для каждого сс из ТЗ цикл
		Если сокрлп(сс.ЕдиницаХраненияОстатков) = "шт" тогда
			 сс.Количество = сс.Количество * сс.ЕдиницаХраненияОстатков.Вес;
		КонецЕсли;	
	КонецЦикла;
	
    ТЗ.Свернуть("Период","Количество");
	
	Для каждого тт из ТЗ цикл
	мСтрок = Объект.ТабЧасть.НайтиСтроки(Новый Структура("День,Контрагент",тт.Период,"Всего:"));
	Если мСтрок.Количество() > 0 тогда
	мСтрок[0].УпакованоВсего = тт.Количество;
	мСтрок[0].Отклонение     = тт.Количество - мСтрок[0].КоличествоКГ;
	КонецЕсли;
	КонецЦикла;

КонецПроцедуры



&НаСервере
Процедура УстановитьУсловноеОформлениеТаблицы()
	
    //УсловноеОформление = ЭтаФорма.УсловноеОформление.Элементы;
	
	//НовыйЭлементУсловногоОформления = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	//НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
	//НовыйЭлементУсловногоОформления.Использование = Истина;	
	//Оформление = НовыйЭлементУсловногоОформления.Оформление;
	//
	//
	////ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	////ЭлементОтбора.Использование = Истина;
	////ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТабЧасть.Контрагент");
	////ЭлементОтбора.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
	////ЭлементОтбора.ПравоеЗначение = "Всего";	
	//
	//НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
	//НовоеПоле.Использование = Истина;
	//НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("Контрагент");	
	//
	//Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина));
	//
	
	
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТабЧастьКонтрагент");	
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТабЧастьДень");	
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТабЧастьУпакованоВсего");											   
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТабЧастьКоличествоЧ");											   
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТабЧастьКоличествоКГ");		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТабЧастьОтклонение");		

		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТабЧасть.Контрагент");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = "Всего:";
		Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина));
	
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТабЧастьОтклонение");	
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТабЧасть.Отклонение");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
		ОтборЭлемента.ПравоеЗначение = 0;
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
		
		
		
	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
	
	ДиалогВыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр						=	"Текст(*.xls;*.xlsx)|*.xls;*.xlsx";
	ДиалогВыбораФайла.Расширение					=	"xls;*.xlsx";
	ДиалогВыбораФайла.МножественныйВыбор 			=   Ложь;
	
	ДиалогВыбораФайла.Заголовок						=	"Выберите файл Excel для документа";
	ДиалогВыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогВыбораФайла.ИндексФильтра					=	0;
	ДиалогВыбораФайла.ПолноеИмяФайла				=	Объект.ПутьКФайлу;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла	=	Истина;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Объект.ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентыСуммаПриИзменении(Элемент)
РассчитатьЦенаЧел();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦенаЧел()
	// Вставить содержимое обработчика.
	Для каждого сс из Объект.Контрагенты цикл
	_ЦенаЧел = окр(сс.Сумма / ?(сс.Человек <> 0,сс.Человек,1)/ ?(сс.Цена <> 0,сс.Цена,1),4,2);
	сс.ЦенаЧел = окр(_ЦенаЧел,3,2);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыЧеловекПриИзменении(Элемент)
РассчитатьЦенаЧел();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыЦенаПриИзменении(Элемент)
РассчитатьЦенаЧел();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
		УстановитьУсловноеОформлениеТаблицы();
КонецПроцедуры


&НаКлиенте
Процедура ТабЧастьКоличествоКГПриИзменении(Элемент)
	
	//_ПересчетТабЧасть();
	_КоличествоЧ = 0; _КоличествоКГ = 0;
	Для каждого сс из Объект.ТабЧасть цикл
		
	Если сс.Контрагент <> "Всего:" тогда
		//сс.КоличествоКГ = сс.ЦенаЧел * сс.КоличествоЧ;
		_КоличествоЧ    = _КоличествоЧ + сс.КоличествоЧ;
		_КоличествоКГ   = _КоличествоКГ + сс.КоличествоКГ;

    КонецЕсли;

	Если сс.Контрагент = "Всего:" тогда	
	сс.КоличествоЧ  = _КоличествоЧ;	
	сс.КоличествоКГ = _КоличествоКГ;	
	сс.Отклонение   = сс.УпакованоВсего  - сс.КоличествоКГ;
	_КоличествоЧ    = 0;
	_КоличествоКГ   = 0;
	КонецЕсли;

    КонецЦикла;
	

КонецПроцедуры


&НаКлиенте
Процедура ТабЧастьКоличествоЧПриИзменении(Элемент)
	
	_ПересчетТабЧасть();

КонецПроцедуры


&НаКлиенте
Процедура _ПересчетТабЧасть()
	_КоличествоЧ = 0; _КоличествоКГ = 0;
	Для каждого сс из Объект.ТабЧасть цикл
		
	Если сс.Контрагент <> "Всего:" тогда
		сс.КоличествоКГ = сс.ЦенаЧел * сс.КоличествоЧ;
		_КоличествоЧ    = _КоличествоЧ + сс.КоличествоЧ;
		_КоличествоКГ   = _КоличествоКГ + сс.КоличествоКГ;

    КонецЕсли;

	Если сс.Контрагент = "Всего:" тогда	
	сс.КоличествоЧ  = _КоличествоЧ;	
	сс.КоличествоКГ = _КоличествоКГ;	
	сс.Отклонение   = сс.УпакованоВсего  - сс.КоличествоКГ;
	_КоличествоЧ    = 0;
	_КоличествоКГ   = 0;
	КонецЕсли;

    КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	УниверсальныеМеханизмы.ОткрытьФормуВыбораПечатныхФормОбъекта(ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.Лео_Переработчики")), ЭтаФорма);
КонецПроцедуры
